arzh_loadTest/get_rendezvous.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 8.472ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 15.778ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.14ms  765.74us   7.63ms   68.62%
    Req/Sec   104.68    109.89   333.00     80.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.15ms
 75.000%    2.64ms
 90.000%    3.07ms
 99.000%    4.08ms
 99.900%    5.34ms
 99.990%    7.64ms
 99.999%    7.64ms
100.000%    7.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.297     0.000000            1         1.00
       1.113     0.100000          390         1.11
       1.485     0.200000          780         1.25
       1.738     0.300000         1170         1.43
       1.943     0.400000         1561         1.67
       2.149     0.500000         1950         2.00
       2.243     0.550000         2145         2.22
       2.339     0.600000         2345         2.50
       2.431     0.650000         2538         2.86
       2.527     0.700000         2732         3.33
       2.643     0.750000         2925         4.00
       2.695     0.775000         3023         4.44
       2.765     0.800000         3120         5.00
       2.837     0.825000         3219         5.71
       2.907     0.850000         3315         6.67
       2.983     0.875000         3417         8.00
       3.025     0.887500         3462         8.89
       3.065     0.900000         3512        10.00
       3.131     0.912500         3562        11.43
       3.189     0.925000         3608        13.33
       3.259     0.937500         3657        16.00
       3.309     0.943750         3682        17.78
       3.355     0.950000         3705        20.00
       3.407     0.956250         3730        22.86
       3.483     0.962500         3754        26.67
       3.553     0.968750         3779        32.00
       3.573     0.971875         3792        35.56
       3.629     0.975000         3804        40.00
       3.721     0.978125         3815        45.71
       3.787     0.981250         3827        53.33
       3.845     0.984375         3840        64.00
       3.897     0.985938         3846        71.11
       3.971     0.987500         3852        80.00
       4.023     0.989062         3858        91.43
       4.115     0.990625         3864       106.67
       4.171     0.992188         3870       128.00
       4.219     0.992969         3873       142.22
       4.231     0.993750         3876       160.00
       4.287     0.994531         3879       182.86
       4.323     0.995313         3882       213.33
       4.419     0.996094         3885       256.00
       4.443     0.996484         3887       284.44
       4.451     0.996875         3888       320.00
       4.487     0.997266         3890       365.71
       4.547     0.997656         3891       426.67
       4.587     0.998047         3893       512.00
       4.879     0.998242         3894       568.89
       4.879     0.998437         3894       640.00
       4.903     0.998633         3895       731.43
       5.343     0.998828         3896       853.33
       5.855     0.999023         3897      1024.00
       5.855     0.999121         3897      1137.78
       5.855     0.999219         3897      1280.00
       6.255     0.999316         3898      1462.86
       6.255     0.999414         3898      1706.67
       6.815     0.999512         3899      2048.00
       6.815     0.999561         3899      2275.56
       6.815     0.999609         3899      2560.00
       6.815     0.999658         3899      2925.71
       6.815     0.999707         3899      3413.33
       7.635     0.999756         3900      4096.00
       7.635     1.000000         3900          inf
#[Mean    =        2.140, StdDeviation   =        0.766]
#[Max     =        7.632, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 518.25KB read
  Non-2xx or 3xx responses: 3039
Requests/sec:    200.05
Transfer/sec:     17.27KB