arzh_loadTest/get_results.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 170.668ms, rate sampling interval: 1605ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  398.95us   2.85ms   67.34%
    Req/Sec   199.75      0.43   200.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.40ms
 90.000%    1.67ms
 99.000%    2.13ms
 99.900%    2.40ms
 99.990%    2.85ms
 99.999%    2.85ms
100.000%    2.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.296     0.000000            1         1.00
       0.632     0.100000          400         1.11
       0.772     0.200000          801         1.25
       0.895     0.300000         1200         1.43
       1.021     0.400000         1601         1.67
       1.143     0.500000         2000         2.00
       1.200     0.550000         2200         2.22
       1.253     0.600000         2401         2.50
       1.297     0.650000         2600         2.86
       1.347     0.700000         2802         3.33
       1.398     0.750000         3003         4.00
       1.422     0.775000         3100         4.44
       1.450     0.800000         3200         5.00
       1.491     0.825000         3300         5.71
       1.533     0.850000         3401         6.67
       1.586     0.875000         3502         8.00
       1.636     0.887500         3550         8.89
       1.676     0.900000         3600        10.00
       1.718     0.912500         3652        11.43
       1.764     0.925000         3701        13.33
       1.817     0.937500         3750        16.00
       1.851     0.943750         3776        17.78
       1.882     0.950000         3800        20.00
       1.914     0.956250         3825        22.86
       1.944     0.962500         3851        26.67
       1.989     0.968750         3876        32.00
       2.012     0.971875         3887        35.56
       2.029     0.975000         3901        40.00
       2.055     0.978125         3913        45.71
       2.073     0.981250         3925        53.33
       2.093     0.984375         3939        64.00
       2.105     0.985938         3943        71.11
       2.113     0.987500         3951        80.00
       2.125     0.989062         3957        91.43
       2.137     0.990625         3963       106.67
       2.145     0.992188         3968       128.00
       2.159     0.992969         3971       142.22
       2.175     0.993750         3975       160.00
       2.177     0.994531         3978       182.86
       2.191     0.995313         3981       213.33
       2.229     0.996094         3984       256.00
       2.231     0.996484         3985       284.44
       2.293     0.996875         3987       320.00
       2.323     0.997266         3989       365.71
       2.325     0.997656         3990       426.67
       2.333     0.998047         3992       512.00
       2.333     0.998242         3992       568.89
       2.347     0.998437         3993       640.00
       2.385     0.998633         3994       731.43
       2.397     0.998828         3995       853.33
       2.445     0.999023         3996      1024.00
       2.445     0.999121         3996      1137.78
       2.445     0.999219         3996      1280.00
       2.511     0.999316         3997      1462.86
       2.511     0.999414         3997      1706.67
       2.595     0.999512         3998      2048.00
       2.595     0.999561         3998      2275.56
       2.595     0.999609         3998      2560.00
       2.595     0.999658         3998      2925.71
       2.595     0.999707         3998      3413.33
       2.847     0.999756         3999      4096.00
       2.847     1.000000         3999          inf
#[Mean    =        1.146, StdDeviation   =        0.399]
#[Max     =        2.846, Total count    =         3999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6001 requests in 30.00s, 556.73KB read
Requests/sec:    200.02
Transfer/sec:     18.56KB