arzh_loadTest/get_single.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.905ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.815ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  483.10us   6.19ms   66.18%
    Req/Sec   104.35    108.53   333.00     81.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.68ms
 90.000%    2.00ms
 99.000%    2.54ms
 99.900%    2.87ms
 99.990%    6.20ms
 99.999%    6.20ms
100.000%    6.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.298     0.000000            1         1.00
       0.728     0.100000          391         1.11
       0.913     0.200000          780         1.25
       1.073     0.300000         1171         1.43
       1.214     0.400000         1561         1.67
       1.346     0.500000         1953         2.00
       1.407     0.550000         2148         2.22
       1.465     0.600000         2344         2.50
       1.530     0.650000         2535         2.86
       1.598     0.700000         2732         3.33
       1.681     0.750000         2925         4.00
       1.722     0.775000         3024         4.44
       1.767     0.800000         3120         5.00
       1.816     0.825000         3219         5.71
       1.877     0.850000         3319         6.67
       1.932     0.875000         3413         8.00
       1.963     0.887500         3462         8.89
       1.998     0.900000         3510        10.00
       2.038     0.912500         3559        11.43
       2.071     0.925000         3608        13.33
       2.117     0.937500         3658        16.00
       2.147     0.943750         3682        17.78
       2.185     0.950000         3705        20.00
       2.207     0.956250         3730        22.86
       2.245     0.962500         3754        26.67
       2.287     0.968750         3779        32.00
       2.305     0.971875         3791        35.56
       2.335     0.975000         3803        40.00
       2.365     0.978125         3816        45.71
       2.389     0.981250         3827        53.33
       2.429     0.984375         3840        64.00
       2.469     0.985938         3846        71.11
       2.511     0.987500         3852        80.00
       2.529     0.989062         3860        91.43
       2.547     0.990625         3864       106.67
       2.579     0.992188         3870       128.00
       2.595     0.992969         3873       142.22
       2.609     0.993750         3876       160.00
       2.627     0.994531         3879       182.86
       2.683     0.995313         3882       213.33
       2.689     0.996094         3885       256.00
       2.747     0.996484         3887       284.44
       2.751     0.996875         3888       320.00
       2.783     0.997266         3890       365.71
       2.789     0.997656         3891       426.67
       2.839     0.998047         3893       512.00
       2.853     0.998242         3894       568.89
       2.853     0.998437         3894       640.00
       2.857     0.998633         3895       731.43
       2.867     0.998828         3896       853.33
       2.895     0.999023         3897      1024.00
       2.895     0.999121         3897      1137.78
       2.895     0.999219         3897      1280.00
       2.931     0.999316         3898      1462.86
       2.931     0.999414         3898      1706.67
       2.999     0.999512         3899      2048.00
       2.999     0.999561         3899      2275.56
       2.999     0.999609         3899      2560.00
       2.999     0.999658         3899      2925.71
       2.999     0.999707         3899      3413.33
       6.195     0.999756         3900      4096.00
       6.195     1.000000         3900          inf
#[Mean    =        1.358, StdDeviation   =        0.483]
#[Max     =        6.192, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 519.39KB read
  Non-2xx or 3xx responses: 2949
Requests/sec:    200.05
Transfer/sec:     17.31KB